Tutorials/FilteredNoiseInflowGenerator/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libfilteredNoiseInflowGenerator.so"
);


application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.012;

deltaT          0.0012;

writeControl    timeStep;
// writeControl    adjustableRunTime;

writeInterval   2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable false;

functions
{       
//     #include "runtimePost/scalarTransport"    
//     #include "runtimePost/fieldAverage"
    
//     faceSourceSumOutlet
//     {
//         type                faceSource;
//         functionObjectLibs  ("libfieldFunctionObjects.so");
//         enabled             true;
//         outputControl       timeStep;
//         log                 true;
//         valueOutput         false;
//         source              patch;
//         sourceName          outlet;
//         operation           sum;
//         fields
//         (
//             Sla
//         );
//     }

}

// ************************************************************************* //

