Tutorials/FilteredNoiseInflowGenerator/system/runtimePost/fieldAverage
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

fieldAverage
    {
        type            fieldAverage;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled           true;
        outputControl     outputTime;
        //region          region0;
        cleanRestart      true;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
            
            // needed by the postProcessing tool yPlusMeanLES
            nuSgs
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
            
            k
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
            
            p
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
            
            Sla
            {
                mean        on;
                prime2Mean  off;
                base        time;
            } 
            
            USla
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
        );
    }

// ************************************************************************* //
