Tutorials/FilteredNoiseInflowGenerator/system/topoSetDict_scalarTransport
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    scalarRelease_Sla;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.4 -0.3 0.0)(0.41  0.3 0.01);

        }
    }
);

// ************************************************************************* //
